In [1]:
# Import the pandas,numpy and datetime libraries
import numpy as np
import pandas as pd
from datetime import datetime

In [2]:
# Initalize the foollowing variables.
myyear=2015
mymonth=1
myday=1
myhour=2
mymin=30
mysec=15

In [3]:
mydate=datetime(myyear,mymonth,myday)

In [4]:
mydate

datetime.datetime(2015, 1, 1, 0, 0)

In [5]:
mydatetime=datetime(myyear,mymonth,myday,myhour,mymin,mysec)

In [6]:
mydatetime

datetime.datetime(2015, 1, 1, 2, 30, 15)

In [7]:
mydatetime.year

2015

In [9]:
mydatetime.month

1

In [10]:
myser = pd.Series(['Nov 3, 1990','2000-01-01',None])

In [11]:
myser

0    Nov 3, 1990
1     2000-01-01
2           None
dtype: object

In [13]:
# becuase this i string object but not datetime
myser[0].year

AttributeError: 'str' object has no attribute 'year'

In [19]:
# Conversion of string to datetime object using pandas to_datetime()
mydt= pd.to_datetime(myser)
mydt= pd.to_datetime(myser[0])
mydt

Timestamp('1990-11-03 00:00:00')

In [20]:
mydt.hour

0

In [21]:
mydt.year

1990

In [22]:
# Convert the '31-12-2000' to date object 
eur_date= '31-12-2000'
pd.to_datetime(eur_date)

Timestamp('2000-12-31 00:00:00')

In [24]:
eur_date= '10-12-2000'
# Note: here 10 is the date , but its considering it as the month US-Style;
pd.to_datetime(eur_date)

Timestamp('2000-10-12 00:00:00')

In [25]:
# Convert the us date format to indian date format using to_dateime US - MM/DD/YYYY EU -DD/MM/YYYY
# This will convert the day to be as the first.
pd.to_datetime(eur_date ,dayfirst=True)

Timestamp('2000-12-10 00:00:00')

In [26]:
styledate ='12--Dec--2000'
pd.to_datetime(styledate,format="%d--%b--%Y")

Timestamp('2000-12-12 00:00:00')

In [27]:
custom_date="12th of Dec 2000"
pd.to_datetime(custom_date)

Timestamp('2000-12-12 00:00:00')

In [35]:
custom_date1="12th mid of Dec 2000"
pd.to_datetime(custom_date1,format="%dth mid of %b %Y")

Timestamp('2000-12-12 00:00:00')

In [36]:
# Note: this cannot be read by the to_datetime so we need to format the string as per above custom formatter
pd.to_datetime(custom_date1)

ParserError: Unknown string format: 12th mid of Dec 2000

In [37]:
sales= pd.read_csv('RetailSales_BeerWineLiquor.csv')

In [38]:
sales

           DATE  MRTSSM4453USN
0    1992-01-01           1509
1    1992-02-01           1541
2    1992-03-01           1597
3    1992-04-01           1675
4    1992-05-01           1822
..          ...            ...
335  2019-12-01           6630
336  2020-01-01           4388
337  2020-02-01           4533
338  2020-03-01           5562
339  2020-04-01           5207

[340 rows x 2 columns]

In [39]:
pd.to_datetime(sales["DATE"])

0     1992-01-01
1     1992-02-01
2     1992-03-01
3     1992-04-01
4     1992-05-01
         ...
335   2019-12-01
336   2020-01-01
337   2020-02-01
338   2020-03-01
339   2020-04-01
Name: DATE, Length: 340, dtype: datetime64[ns]

In [40]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 340 entries, 0 to 339
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   DATE           340 non-null    object
 1   MRTSSM4453USN  340 non-null    int64
dtypes: int64(1), object(1)
memory usage: 5.4+ KB

In [45]:
sales['DATE']= pd.to_datetime(sales['DATE'])

In [48]:
sales['DATE'][0].year , sales['DATE'][0].month ,sales['DATE'][0].day

(1992, 1, 1)

In [50]:
# this will automatically aprse the first column as the datetime rather than String
sales1= pd.read_csv('RetailSales_BeerWineLiquor.csv',parse_dates=[0])
sales1

          DATE  MRTSSM4453USN
0   1992-01-01           1509
1   1992-02-01           1541
2   1992-03-01           1597
3   1992-04-01           1675
4   1992-05-01           1822
..         ...            ...
335 2019-12-01           6630
336 2020-01-01           4388
337 2020-02-01           4533
338 2020-03-01           5562
339 2020-04-01           5207

[340 rows x 2 columns]

In [54]:
# The resultant below string showsa us the imported result is of type DATETIME
sales1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 340 entries, 0 to 339
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   DATE           340 non-null    datetime64[ns]
 1   MRTSSM4453USN  340 non-null    int64
dtypes: datetime64[ns](1), int64(1)
memory usage: 5.4 KB

In [56]:
sales1['DATE'][0]

Timestamp('1992-01-01 00:00:00')

In [61]:
sales = sales.set_index('DATE')
sales.index

DatetimeIndex(['1992-01-01', '1992-02-01', '1992-03-01', '1992-04-01',
               '1992-05-01', '1992-06-01', '1992-07-01', '1992-08-01',
               '1992-09-01', '1992-10-01',
               ...
               '2019-07-01', '2019-08-01', '2019-09-01', '2019-10-01',
               '2019-11-01', '2019-12-01', '2020-01-01', '2020-02-01',
               '2020-03-01', '2020-04-01'],
              dtype='datetime64[ns]', name='DATE', length=340, freq=None)

In [62]:
sales.resample(rule='A')
# A-> grouping by the year 
# Refer to TIME SERIES (OFFSET ALIASES) documentation

In [63]:
# Calculate the mean of sales dataframe data aggregating by rule year
# Hint - sales.resample()
sales.resample(rule='A').mean()

            MRTSSM4453USN
DATE
1992-12-31    1807.250000
1993-12-31    1794.833333
1994-12-31    1841.750000
1995-12-31    1833.916667
1996-12-31    1929.750000
1997-12-31    2006.750000
1998-12-31    2115.166667
1999-12-31    2206.333333
2000-12-31    2375.583333
2001-12-31    2468.416667
2002-12-31    2491.166667
2003-12-31    2539.083333
2004-12-31    2682.416667
2005-12-31    2797.250000
2006-12-31    3001.333333
2007-12-31    3177.333333
2008-12-31    3292.000000
2009-12-31    3353.750000
2010-12-31    3450.083333
2011-12-31    3532.666667
2012-12-31    3697.083333
2013-12-31    3839.666667
2014-12-31    4023.833333
2015-12-31    4212.500000
2016-12-31    4434.416667
2017-12-31    4602.666667
2018-12-31    4830.666667
2019-12-31    4972.750000
2020-12-31    4922.500000

In [64]:
sales1= pd.read_csv('RetailSales_BeerWineLiquor.csv',parse_dates=[0])
sales1

          DATE  MRTSSM4453USN
0   1992-01-01           1509
1   1992-02-01           1541
2   1992-03-01           1597
3   1992-04-01           1675
4   1992-05-01           1822
..         ...            ...
335 2019-12-01           6630
336 2020-01-01           4388
337 2020-02-01           4533
338 2020-03-01           5562
339 2020-04-01           5207

[340 rows x 2 columns]

In [85]:
sales1['DATE'].dt.year[0]

1992

In [93]:
# Fetch me the to 6 records of the 'DATE' column data
sales1['DATE'].loc[0:5]

0   1992-01-01
1   1992-02-01
2   1992-03-01
3   1992-04-01
4   1992-05-01
5   1992-06-01
Name: DATE, dtype: datetime64[ns]